app/controllers/owner/vans_controller.rb

  def create
    van = Van.new(vans_params)
    van.owner = current_user
    van.save
---
INSERT INTO "vans" ("title", "description", "price_per_day", "user_id", "model", "brand", "picture", "address", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"