app/controllers/rents_controller.rb

  def create
    @rent = Rent.new(rent_params)
    @rent.van = @van
    @rent.traveler = current_user
    @rent.total_price = @van.price_per_day * (@duration + 1)

    if @rent.save
---
INSERT INTO "rents" ("begin_date", "end_date", "van_id", "user_id", "total_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

  def set_van
    @van = Van.find(params[:van_id])
---
SELECT  "vans".* FROM "vans" WHERE "vans"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]