app/controllers/vans_controller.rb

SELECT "vans".* FROM "vans"
---
  def index
    if params[:search]
      q = params[:search]

      @vans = Van.select { |van| van.available?(end_date: Date.parse(q[:end_date]), begin_date: Date.parse(q[:begin_date])) }
    else
      @vans = Van.all

SELECT  "vans".* FROM "vans" WHERE "vans"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def show
    @van = Van.find(params[:id])